{
  "title": {
    "media": {
      "url": "https://upload.wikimedia.org/wikipedia/commons/6/6b/John_F._Kennedy_Lying_in_State_November_24%2C_1963_%2810965699893%29.jpg",
      "caption": "President Kennedy casket rests atop the Lincoln catafalque in Capitol Rotunda",
      "credit": "Architect of the Capitol photographers"
    },
    "text": {
      "headline": "Detail of the events around President John Fitzgerald Kennedy's death",
      "text": "Clipped from Wikipedia, a series of events of note around the 35th president of the USA's death represented in a timeline"
    }
  },
  "events": [
    {
      "media": {
        "url": "",
        "caption": "",
        "link": "",
        "credit": ""
      },
      "start_date": {
        "year": "1963",
        "month": 11,
        "day": 21
      },
      "text": {
        "headline": "JFK's last edict before his Dallas trip",
        "text": "President Kennedy asks his economic advisers to prepare the War on Poverty for 1964. Less than two months after the President's assassination, President Johnson introduces the legislation in his first State of the Union address on January 8, 1964, and two of the major pieces of related legislation – the Economic Opportunity Act of 1964 and the Social Security Act of 1965 – are signed into law on August 20, 1964, and July 30, 1965, respectively."
      }
    },
    {
      "media": {
        "url": "https://upload.wikimedia.org/wikipedia/en/5/52/Zapruder-150.jpg",
        "caption": "Frame 150 from the Zapruder film. Kennedy's limousine has just turned onto Elm Street, moments before the first shot, and the President is apparently waving.",
        "link": "",
        "credit": "Abraham Zapruder"
      },
      "start_date": {
        "year": "1963",
        "month": 11,
        "day": 22,
        "hour": 12,
        "minute": 30
      },
      "text": {
        "headline": "Kennedy shot",
        "text": "President Kennedy and Texas Governor John Connally are shot at 12:30 p.m. CST (18:30 UTC) in Dealey Plaza, Dallas, Texas. They are rushed to Parkland Memorial Hospital, where Kennedy is pronounced dead at 1:00 p.m. CST (19:00 UTC). Lee Harvey Oswald is arrested and charged with the murder. Oswald is shot and killed two days later by nightclub owner Jack Ruby.\n"
      }
    },
    {
      "media": {
        "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cc/Lyndon_B._Johnson_taking_the_oath_of_office%2C_November_1963.jpg/1024px-Lyndon_B._Johnson_taking_the_oath_of_office%2C_November_1963.jpg",
        "caption": "Lyndon B. Johnson taking the oath of office aboard Air Force One at Love Field Airport",
        "link": "",
        "credit": "An employee of the Executive Office of the President of the United States"
      },
      "start_date": {
        "year": "1963",
        "month": 11,
        "day": 22,
        "hour": 14,
        "minute": 38
      },
      "text": {
        "headline": "Lyndon B. Johnson sworn in as 36th president",
        "text": "Vice President Lyndon B. Johnson succeeds to the Presidency and is sworn in aboard Air Force One."
      }
    },
    {
      "media": {
        "url": "https://upload.wikimedia.org/wikipedia/commons/f/f7/JFK_casket_in_White_House.jpg",
        "caption": "Casket of U.S. President John F. Kennedy, in East Room of the White House",
        "link": "",
        "credit": "A work prepared by an officer or employee of the United States Government"
      },
      "start_date": {
        "year": "1963",
        "month": 11,
        "day": 23
      },
      "text": {
        "headline": "Kennedy lies in repose - White House",
        "text": "Kennedy lies in repose in the White House East Room for a period of 24 hours. At 4:45 pm, President Johnson issues Proclamation 3561, declaring November 25, the day of the funeral service, to be a national day of mourning."
      }
    },
    {
      "media": {
        "url": "https://www.aoc.gov/sites/default/files/styles/scaled_xl/public/10965699893_188e3a5e23_o.jpg?itok=nqCh7C8g",
        "caption": "John F. Kennedy lying in state November 24-25, 1963",
        "link": "https://www.aoc.gov/what-we-do/programs-ceremonies/lying-in-state-honor",
        "credit": "An employee of the Architect of the Capitol"
      },
      "start_date": {
        "year": "1963",
        "month": 11,
        "day": 24
      },
      "text": {
        "headline": "Kennedy lies in state - US Capitol building",
        "text": "Kennedy lies in state for a period of 18 hours. NBC broadcasts live uninterrupted coverage of people passing through the Capitol rotunda during the overnight hours."
      }
    },
    {
      "media": {
        "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a3/St._Matthew%27s_Cathedral_and_Rectory-29.jpg/800px-St._Matthew%27s_Cathedral_and_Rectory-29.jpg",
        "caption": "&qt;Here Rested The Remains Of President Kennedy&qt; set in the the floor in front of the altar of Saint Matthew's Cathedral in Washington, D.C.",
        "link": "",
        "credit": "Matthew Roth via Wikimedia"
      },
      "start_date": {
        "year": "1963",
        "month": 11,
        "day": 25,
        "hour": 12,
        "minute": 14
      },
      "text": {
        "headline": "Kennedy's funeral at St. Matthew's Cathedral, Washington D.C.",
        "text": "Kennedy's funeral service is held. Representatives from over 90 countries attend the ceremony."
      }
    },
    {
      "media": {
        "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/JFK_Funeral_and_temporary_grave_November_25_1963.jpg/582px-JFK_Funeral_and_temporary_grave_November_25_1963.jpg",
        "caption": "Mrs. Jacqueline Kennedy and U.S. Attorney General Robert F. Kennedy walk away from the casket of slain President John F. Kennedy during the presidential funeral at Arlington National Cemetery on November 25, 1963. Mrs. Kennedy carries the flag which draped her husband's casket under her arm. The evergreen boughs which cover the base of the temporary Eternal Flame (which was placed at the head of the casket) can be seen between the two people. Cardinal Richard Cushing (to the right of the casket, in black cape) has his back to the camera. President Lyndon B. Johnson can be seen in the upper middle-left portion of the image. The Presidential Honor Guard is just in front of Mrs. Kennedy, to the left. (Note the presence of the U.S. Army Special Forces soldier, wearing the traditional green beret at Mrs. Kennedy's request.)",
        "link": "",
        "credit": "A National Park Service employee"
      },
      "start_date": {
        "year": "1963",
        "month": 11,
        "day": 25,
        "hour": 15,
        "minute": 34
      },
      "text": {
        "headline": "Kennedy's burial",
        "text": "President Kennedy is laid to rest at Arlington National Cemetery. Upon the request of the now-former First Lady Jacqueline Kennedy on the day before, an eternal flame, inspired by the Tomb of the Unknown Soldier at the Arc de Triomphe in Paris, known later as the John F. Kennedy Eternal Flame, is set up by the United States Army Corps of Engineers, and first lit by Mrs. Kennedy.\n"
      }
    }
  ]
}
